# Loading a CSV into a Pandas Dataframe

Here is a step-by-step introduction to converting CSV data into a pandas dataframe.

In [2]:
# importing modules
import pandas as pd
import numpy as np

## Load a CSV

In [3]:
# load a CSV into a Pandas dataframe
df = pd.read_csv('example.csv')

In [4]:
df

  FirstName LastName  Age  Income
0      anne  Redston   23   80000
1     Billy  Johnson   34  116000
2      Sean        B   67   79000
3     Nancy    Smith   25   95000
4    victor      chu   29  120000
5   Pradeep     Shah   40   35000

## Load only certain columns of a CSV

In [10]:
# load csv while specifying column names
df = pd.read_csv('example.csv', usecols=['FirstName', 'LastName', 'Age'])

In [11]:
df

  FirstName LastName  Age
0      anne  Redston   23
1     Billy  Johnson   34
2      Sean        B   67
3     Nancy    Smith   25
4    victor      chu   29
5   Pradeep     Shah   40

## Load a CSV with no headers

In [12]:
df = pd.read_csv('example.csv', header=None)

In [13]:
df

           0         1    2       3
0  FirstName  LastName  Age  Income
1       anne   Redston   23   80000
2      Billy   Johnson   34  116000
3       Sean         B   67   79000
4      Nancy     Smith   25   95000
5     victor       chu   29  120000
6    Pradeep      Shah   40   35000